In [1]:
#Dependencies
import pandas as pd
import numpy as np

In [2]:
#Import CSV File
nr_2016_sta_path = "Input_Data/Nice_Ride_2016_station_locations.csv"
nr_2016_trip_path = "Input_Data/Nice_ride_trip_history_2016_season.csv"

In [3]:
#Read data to df
station_16 = pd.read_csv(nr_2016_sta_path, dtype={"Terminal":str, "Station":str, "Latitude":float, "Longitude":float, "NbDocks":int, "Notes":str})
station_16.head()

,Terminal,Station,Latitude,Longitude,Nb Docks,Unnamed: 5
0,30000,100 Main Street SE,44.984892,-93.256551,27,NaN
1,30039,10th Street & Nicollet Mall,44.973839,-93.274544,11,NaN
2,30117,10th Street E & Cedar Street,44.950189,-93.097590,15,NaN
3,30154,11th Ave S & S 2nd Street,44.976730,-93.252189,23,NaN
4,30004,11th Street & Hennepin,44.975340,-93.278690,23,NaN

In [4]:
len(station_16)

202

In [5]:
trip_16 = pd.read_csv(nr_2016_trip_path, dtype={"Start date":str, "Start station":str, "Start station number":str, "End date":str, "End station":str, "End station number":str, "Total duration (Seconds)":int, "Account type":str})
trip_16.head()

,Start date,Start station,Start station number,End date,End station,End station number,Total duration (seconds),Account type
0,11/6/2016 22:09,Willey Hall,30195,11/6/2016 22:14,McNamara Center,30057,325,Casual
1,11/6/2016 21:53,Sanford Hall,30182,11/6/2016 21:59,McNamara Center,30057,315,Member
2,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1504,Casual
3,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1496,Casual
4,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1506,Casual

In [6]:
len(trip_16)

1048575